TITLE: "app-yolov5_resnet-mpii"
TYPE: "yaml"
AUTO_RESUME: true

MISC:
  PRINT_FREQ: 100
  OUTPUT_DIR: 'output'
  LOG_DIR: 'log'

DEVICE:
  GPUS: (0,)
  CUDNN:
    BENCHMARK: true
    DETERMINISTIC: false
    ENABLED: true
  WORKERS: 24

DATASET:
  KIND:
  - YOLOV5: "coco"
  - RESNET: "mpii"
  YOLOV5:
    COLOR_RGB: true
    DATASET: coco
    DATA_FORMAT: jpg
    FLIP: true
    ROOT: '../../data/datasets/COCO/extracted/coco/'
    TEST_SET: val2017
    TRAIN_SET: train2017
  RESNET:
    COLOR_RGB: true
    DATASET: mpii
    DATA_FORMAT: jpg
    FLIP: true
    NUM_JOINTS_HALF_BODY: 8
    PROB_HALF_BODY: -1.0
    ROOT: '../../data/datasets/MPII/extracted/mpii/'
    ROT_FACTOR: 30
    SCALE_FACTOR: 0.25
    TEST_SET: valid
    TRAIN_SET: train

MODEL:
  NAME:
    YOLOV5: "yolov5s"
    RESNET: "pose_resnet_new"
  PRETRAINED:
    YOLOV5: "../../data/weights/pretrained/yolov5/pytorch/yolov5/yolov5l.pt"
    RESNET: "../../data/weights/pretrained/hrnet/pytorch/pose_mpii/pose_resnet_50_256x256.pth.tar"
  YOLOV5:
    NUM_JOINTS: 16
    nc: 80  # number of classes
    depth_multiple: 1.0  # model depth multiple
    width_multiple: 1.0  # layer channel multiple
    anchors:
      - [10,13, 16,30, 33,23]  # P3/8
      - [30,61, 62,45, 59,119]  # P4/16
      - [116,90, 156,198, 373,326]  # P5/32
    backbone:
      # [from, number, module, args]
      [[-1, 1, Focus, [64, 3]],  # 0-P1/2
      [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
      [-1, 3, BottleneckCSP, [128]],
      [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
      [-1, 9, BottleneckCSP, [256]],
      [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
      [-1, 9, BottleneckCSP, [512]],
      [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
      [-1, 1, SPP, [1024, [5, 9, 13]]],
      [-1, 3, BottleneckCSP, [1024, False]],  # 9
      ]
    head:
      [[-1, 1, Conv, [512, 1, 1]],
      [-1, 1, nn.Upsample, [None, 2, 'nearest']],
      [[-1, 6], 1, Concat, [1]],  # cat backbone P4
      [-1, 3, BottleneckCSP, [512, False]],  # 13
      
      [-1, 1, Conv, [256, 1, 1]],
      [-1, 1, nn.Upsample, [None, 2, 'nearest']],
      [[-1, 4], 1, Concat, [1]],  # cat backbone P3
      [-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small)
      
      [-1, 1, Conv, [256, 3, 2]],
      [[-1, 14], 1, Concat, [1]],  # cat head P4
      [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)
      
      [-1, 1, Conv, [512, 3, 2]],
      [[-1, 10], 1, Concat, [1]],  # cat head P5
      [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)
      
      [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
      ]
  RESNET:
    INIT_WEIGHTS: true
    IMAGE_SIZE:
    - 256
    - 256
    HEATMAP_SIZE:
    - 64
    - 64
    SIGMA: 2
    NUM_JOINTS: 16
    TARGET_TYPE: "gaussian"
    EXTRA:
      FINAL_CONV_KERNEL: 1
      DECONV_WITH_BIAS: false
      NUM_DECONV_LAYERS: 3
      NUM_DECONV_FILTERS:
      - 256
      - 256
      - 256
      NUM_DECONV_KERNELS:
      - 4
      - 4
      - 4
      NUM_LAYERS: 50
    LOSS:
      USE_TARGET_WEIGHT: true

TRAIN:
  YOLOV5:
    BATCH_SIZE_PER_GPU: 32
  RESNET:
    BATCH_SIZE_PER_GPU: 32
    SHUFFLE: true
    BEGIN_EPOCH: 0
    END_EPOCH: 140
    OPTIMIZER: 'adam'
    LR: 0.001
    LR_FACTOR: 0.1
    LR_STEP:
    - 90
    - 120
    WD: 0.0001
    GAMMA1: 0.99
    GAMMA2: 0.0
    MOMENTUM: 0.9
    NESTEROV: false

EVAL:
  YOLOV5:
    BATCH_SIZE_PER_GPU: 32
  RESNET:
    BATCH_SIZE_PER_GPU: 32
    COCO_BBOX_FILE: '../../data/datasets/COCO/extracted/coco/person_detection_results/COCO_val2017_detections_AP_H_56_person.json'
    BBOX_THRE: 1.0
    IMAGE_THRE: 0.0
    IN_VIS_THRE: 0.2
    MODEL_FILE: "../../data/weights/pretrained/hrnet/pytorch/pose_mpii/pose_resnet_50_256x256.pth.tar"
    NMS_THRE: 1.0
    OKS_THRE: 0.9
    FLIP_TEST: true
    POST_PROCESS: true
    SHIFT_HEATMAP: true
    USE_GT_BBOX: true
    USE_FILTERS_2D: true

DEBUG:
  YOLOV5:
    DEBUG: true
  RESNET:
    DEBUG: true
    SAVE_BATCH_IMAGES_GT: true
    SAVE_BATCH_IMAGES_PRED: true
    SAVE_HEATMAPS_GT: true
    SAVE_HEATMAPS_PRED: true
