TITLE: "app-yolov5_hrnet_to3d-mpii-all"
TYPE: "yaml"
AUTO_RESUME: true

MISC:
  PRINT_FREQ: 100
  OUTPUT_DIR: 'output'
  LOG_DIR: 'log'

DEVICE:
  GPUS: (0,)
  CUDNN:
    BENCHMARK: true
    DETERMINISTIC: false
    ENABLED: true
  WORKERS: 24

DATASET:
  KIND:
  - YOLOV5: "coco"
  - HRNET: "mpii"
  - TO3D: "human36m"
  YOLOV5:
    COLOR_RGB: true
    DATASET: coco
    DATA_FORMAT: jpg
    FLIP: true
    ROOT: '../../data/datasets/COCO/extracted/coco/'
    TEST_SET: val2017
    TRAIN_SET: train2017
  HRNET:
    COLOR_RGB: true
    DATASET: mpii
    DATA_FORMAT: jpg
    FLIP: true
    NUM_JOINTS_HALF_BODY: 8
    PROB_HALF_BODY: -1.0
    ROOT: '../../data/datasets/MPII/extracted/mpii/'
    ROT_FACTOR: 30
    SCALE_FACTOR: 0.25
    TEST_SET: valid
    TRAIN_SET: train
  TO3D:
    COLOR_RGB: true
    ROOT: '../../data/datasets/Human3.6M/processed/'
    TEST_SET: 
    - S1
    - S5
    - S6
    - S7
    - S8
    TRAIN_SET:
    - S9
    - S11

MODEL:
  NAME:
    YOLOV5: "yolov5s"
    HRNET: "pose_hrnet_new"
    TO3D: "VideoPose3D"
  PRETRAINED:
    YOLOV5: "../../data/weights/pretrained/yolov5/pytorch/yolov5/yolov5l.pt"
    HRNET: "../../data/weights/pretrained/hrnet/pytorch/pose_mpii/pose_hrnet_w32_256x256.pth"
    TO3D: "../To3d/checkpoint/epoch_120.bin"
  YOLOV5:
    NUM_JOINTS: 16
    nc: 80  # number of classes
    depth_multiple: 1.0  # model depth multiple
    width_multiple: 1.0  # layer channel multiple
    anchors:
      - [10,13, 16,30, 33,23]  # P3/8
      - [30,61, 62,45, 59,119]  # P4/16
      - [116,90, 156,198, 373,326]  # P5/32
    backbone:
      # [from, number, module, args]
      [[-1, 1, Focus, [64, 3]],  # 0-P1/2
      [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
      [-1, 3, BottleneckCSP, [128]],
      [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
      [-1, 9, BottleneckCSP, [256]],
      [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
      [-1, 9, BottleneckCSP, [512]],
      [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
      [-1, 1, SPP, [1024, [5, 9, 13]]],
      [-1, 3, BottleneckCSP, [1024, False]],  # 9
      ]
    head:
      [[-1, 1, Conv, [512, 1, 1]],
      [-1, 1, nn.Upsample, [None, 2, 'nearest']],
      [[-1, 6], 1, Concat, [1]],  # cat backbone P4
      [-1, 3, BottleneckCSP, [512, False]],  # 13
      
      [-1, 1, Conv, [256, 1, 1]],
      [-1, 1, nn.Upsample, [None, 2, 'nearest']],
      [[-1, 4], 1, Concat, [1]],  # cat backbone P3
      [-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small)
      
      [-1, 1, Conv, [256, 3, 2]],
      [[-1, 14], 1, Concat, [1]],  # cat head P4
      [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)
      
      [-1, 1, Conv, [512, 3, 2]],
      [[-1, 10], 1, Concat, [1]],  # cat head P5
      [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)
      
      [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
      ]
  HRNET:
    INIT_WEIGHTS: true
    IMAGE_SIZE:
    - 256
    - 256
    HEATMAP_SIZE:
    - 64
    - 64
    SIGMA: 2
    NUM_JOINTS: 16
    TARGET_TYPE: "gaussian"
    EXTRA:
      PRETRAINED_LAYERS:
      - 'conv1'
      - 'bn1'
      - 'conv2'
      - 'bn2'
      - 'layer1'
      - 'transition1'
      - 'stage2'
      - 'transition2'
      - 'stage3'
      - 'transition3'
      - 'stage4'
      FINAL_CONV_KERNEL: 1
      STAGE2:
        NUM_MODULES: 1
        NUM_BRANCHES: 2
        BLOCK: BASIC
        NUM_BLOCKS:
        - 4
        - 4
        NUM_CHANNELS:
        - 32
        - 64
        FUSE_METHOD: SUM
      STAGE3:
        NUM_MODULES: 4
        NUM_BRANCHES: 3
        BLOCK: BASIC
        NUM_BLOCKS:
        - 4
        - 4
        - 4
        NUM_CHANNELS:
        - 32
        - 64
        - 128
        FUSE_METHOD: SUM
      STAGE4:
        NUM_MODULES: 3
        NUM_BRANCHES: 4
        BLOCK: BASIC
        NUM_BLOCKS:
        - 4
        - 4
        - 4
        - 4
        NUM_CHANNELS:
        - 32
        - 64
        - 128
        - 256
        FUSE_METHOD: SUM
  TO3D:
    INIT_WEIGHTS: true
    NUM_JOINTS: 16

TRAIN:
  YOLOV5:
    BATCH_SIZE_PER_GPU: 32
  HRNET:
    BATCH_SIZE_PER_GPU: 32
    SHUFFLE: true
    BEGIN_EPOCH: 0
    END_EPOCH: 210
    OPTIMIZER: adam
    LR: 0.001
    LR_FACTOR: 0.1
    LR_STEP:
    - 170
    - 200
    WD: 0.0001
    GAMMA1: 0.99
    GAMMA2: 0.0
    MOMENTUM: 0.9
    NESTEROV: false
  TO3D:
    BATCH_SIZE_PER_GPU: 32

EVAL:
  YOLOV5:
    BATCH_SIZE_PER_GPU: 32
  HRNET:
    BATCH_SIZE_PER_GPU: 32
    MODEL_FILE: '../../data/weights/pretrained/hrnet/pytorch/pose_mpii/pose_hrnet_w32_256x256.pth'
    FLIP_TEST: true
    POST_PROCESS: true
    SHIFT_HEATMAP: true
    USE_FILTERS_2D: true
  TO3D:
    USE_FILTERS_3D: true

DEBUG:
  YOLOV5:
    DEBUG: true
  HRNET:
    DEBUG: true
    SAVE_BATCH_IMAGES_GT: true
    SAVE_BATCH_IMAGES_PRED: true
    SAVE_HEATMAPS_GT: true
    SAVE_HEATMAPS_PRED: true
  TO3D:
    DEBUG: true
